{
  "legal": {
    "cookieConsent": {
      "title": "การตั้งค่าคุกกี้",
      "description": "เราใช้คุกกี้เพื่อให้คุณได้รับประสบการณ์ที่ดีที่สุดบนเว็บไซต์ของเรา บางคุกกี้จำเป็น บางคุกกี้ช่วยให้เราปรับปรุงเว็บไซต์",
      "customize": "กำหนดเอง",
      "necessary": "เฉพาะที่จำเป็น",
      "acceptAll": "ยอมรับทั้งหมด",
      "detailsTitle": "จัดการการตั้งค่าคุกกี้",
      "functional": "คุกกี้การทำงาน",
      "functionalDesc": "ปรับปรุงประสบการณ์ผู้ใช้และเปิดใช้เนื้อหาที่เป็นส่วนบุคคล",
      "analytics": "คุกกี้การวิเคราะห์",
      "analyticsDesc": "ช่วยให้เราเข้าใจว่าผู้เยี่ยมชมมีปฏิสัมพันธ์กับเว็บไซต์อย่างไร (แบบไม่ระบุตัวตน)",
      "marketing": "คุกกี้การตลาด",
      "marketingDesc": "เปิดใช้การโฆษณาส่วนบุคคลและการติดตามข้ามหลายเว็บไซต์",
      "necessaryDesc": "คุกกี้เหล่านี้จำเป็นสำหรับการทำงานพื้นฐานของเว็บไซต์และไม่สามารถปิดใช้งานได้",
      "savePreferences": "บันทึกการตั้งค่า"
    },
    "privacyPolicy": "นโยบายความเป็นส่วนตัว",
    "terms": {
      "title": "ข้อกำหนดและเงื่อนไข",
      "version": "เวอร์ชัน",
      "newVersion": "มีเวอร์ชันใหม่",
      "versionHistory": "ประวัติเวอร์ชัน",
      "current": "ปัจจุบัน",
      "acceptanceText": "ข้าพเจ้าได้อ่านและยอมรับข้อกำหนดและเงื่อนไข",
      "acceptAndContinue": "ยอมรับและดำเนินการต่อ",
      "lastUpdated": "อัปเดตล่าสุด",
      "acceptedVersion": "เวอร์ชันที่ยอมรับ",
      "scope": {
        "title": "ขอบเขตการใช้งาน",
        "content": "ข้อกำหนดและเงื่อนไขเหล่านี้ใช้กับสัญญาทั้งหมดสำหรับการส่งมอบสินค้าที่ผู้บริโภคหรือผู้ประกอบการทำกับเราในฐานะผู้ขาย",
        "variations": "เงื่อนไขที่แตกต่างของลูกค้าจะได้รับการยอมรับเฉพาะเมื่อเราตกลงอย่างชัดเจนเป็นลายลักษณ์อักษรเท่านั้น"
      },
      "contract": {
        "title": "การก่อตั้งสัญญา",
        "offer": "การแสดงผลิตภัณฑ์ในร้านค้าออนไลน์ไม่ถือเป็นข้อเสนอสัญญาที่มีผลผูกพันตามกฎหมายจากฝ่ายเรา",
        "order": "การส่งคำสั่งซื้อถือเป็นข้อเสนอที่มีผลผูกพันในการซื้อสินค้าที่อยู่ในตะกร้าสินค้า",
        "acceptance": "สัญญาซื้อขายจะสมบูรณ์เมื่อเรายอมรับคำสั่งซื้อของคุณผ่านอีเมลยืนยันคำสั่งซื้อหรือจัดส่งสินค้า"
      },
      "payment": {
        "title": "ราคาและการชำระเงิน",
        "prices": "ราคาทั้งหมดรวมภาษีมูลค่าเพิ่มตามกฎหมายและองค์ประกอบราคาอื่น ๆ",
        "methods": "การชำระเงินทำได้โดยการชำระล่วงหน้า บัตรเครดิต หรือ PayPal",
        "due": "สำหรับการชำระล่วงหน้า ราคาซื้อจะต้องชำระทันทีหลังจากทำสัญญา"
      },
      "delivery": {
        "title": "การจัดส่ง",
        "time": "การจัดส่งใช้เวลา 7-14 วันทำการหลังจากได้รับการชำระเงิน",
        "area": "เราจัดส่งเฉพาะในสหภาพยุโรปเท่านั้น",
        "costs": "ค่าจัดส่งจะแสดงในระหว่างกระบวนการสั่งซื้อและลูกค้าจะต้องรับผิดชอบ"
      },
      "withdrawal": {
        "title": "สิทธิในการถอนตัว",
        "instructionTitle": "คำแนะนำในการถอนตัว",
        "right": "คุณมีสิทธิที่จะถอนตัวจากสัญญานี้ภายในสิบสี่วันโดยไม่ต้องให้เหตุผล",
        "period": "ระยะเวลาการถอนตัวคือสิบสี่วันนับจากวันที่คุณหรือบุคคลที่สามที่คุณกำหนดได้รับสินค้า",
        "contact": "เพื่อใช้สิทธิในการถอนตัวของคุณ คุณต้องแจ้งให้เราทราบโดยการแจ้งที่ชัดเจนเกี่ยวกับการตัดสินใจของคุณ"
      },
      "warranty": {
        "title": "การรับประกัน",
        "legal": "บทบัญญัติการรับประกันตามกฎหมายจะใช้บังคับ",
        "defects": "ข้อบกพร่องต้องรายงานให้เราทราบทันทีเป็นลายลักษณ์อักษร"
      },
      "privacy": {
        "title": "การคุ้มครองข้อมูล",
        "processing": "ข้อมูลส่วนบุคคลของคุณจะถูกประมวลผลตามนโยบายความเป็นส่วนตัวของเรา",
        "consent": "การสั่งซื้อถือเป็นการยินยอมให้ประมวลผลข้อมูลเพื่อวัตถุประสงค์ที่ระบุไว้"
      },
      "law": {
        "title": "กฎหมายที่ใช้บังคับ",
        "content": "กฎหมายของสาธารณรัฐเยอรมนีใช้บังคับกับความสัมพันธ์ทางกฎหมายทั้งหมดระหว่างเราและลูกค้า"
      }
    },
    "privacy": {
      "title": "นโยบายความเป็นส่วนตัว",
      "lastUpdated": "อัปเดตล่าสุด: 15 มกราคม 2024",
      "sections": {
        "dataController": {
          "title": "ผู้ควบคุมข้อมูล",
          "content": "ผู้รับผิดชอบการประมวลผลข้อมูลบนเว็บไซต์นี้:\n\nDIY Humanoid Configurator\nSample Street 123\n12345 Berlin\nอีเมล: privacy@diy-humanoid.com"
        },
        "dataCollection": {
          "title": "การเก็บรวบรวมข้อมูล",
          "content": "เราเก็บรวบรวมข้อมูลส่วนบุคคลเฉพาะเมื่อคุณให้ข้อมูลแก่เราโดยสมัครใจหรือเมื่อจำเป็นเพื่อปฏิบัติตามวัตถุประสงค์ของสัญญา"
        },
        "cookies": {
          "title": "คุกกี้",
          "content": "เว็บไซต์นี้ใช้คุกกี้ สำหรับข้อมูลเพิ่มเติม โปรดดูการตั้งค่าคุกกี้ของเรา"
        },
        "rights": {
          "title": "สิทธิของคุณ",
          "content": "คุณมีสิทธิในการเข้าถึงข้อมูล การแก้ไข การลบ การจำกัดการประมวลผล การคัดค้าน และการพกพาข้อมูล"
        }
      }
    },
    "imprint": {
      "title": "ข้อมูลทางกฎหมาย",
      "company": "DIY Humanoid Configurator",
      "address": "Sample Street 123\n12345 Berlin\nเยอรมนี",
      "contact": "อีเมล: info@diy-humanoid.com\nโทรศัพท์: +49 (0) 30 12345678",
      "legal": "ผู้จัดการ: Max Mustermann\nทะเบียนการค้า: HRB 12345 B\nรหัสภาษีมูลค่าเพิ่ม: DE123456789"
    },
    "compliance": {
      "gdprCompliant": "เป็นไปตาม GDPR",
      "dataProcessing": "การประมวลผลข้อมูล",
      "consent": "ความยินยอม",
      "withdraw": "ถอน",
      "dataSubjectRights": "สิทธิของเจ้าของข้อมูล",
      "contact": "ติดต่อ",
      "legalBasis": "ฐานทางกฎหมาย",
      "retention": "ระยะเวลาการเก็บรักษา",
      "processors": "ผู้ประมวลผลข้อมูล"
    }
  },
  "sidebar": {
    "netPrice": "ราคาสุทธิ",
    "grossPrice": "ราคารวมภาษี",
    "plusVAT": "บวก",
    "showGross": "แสดงราคารวม",
    "showNet": "แสดงราคาสุทธิ",
    "hideVATDetails": "ซ่อนรายละเอียดภาษี",
    "showVATDetails": "รายละเอียดภาษี",
    "country": "ประเทศ",
    "netAmount": "จำนวนสุทธิ",
    "totalGross": "จำนวนรวม",
    "taxNote": "ราคาใช้สำหรับ"
  }
}